MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC1302-Q024X0032/mcu.h
/* --------------------------------  BCCU_CHSTRCON  ------------------------------- */
#define BCCU_CHSTRCON_CH0S_Pos                (0UL)                     /*!< BCCU CHSTRCON: CH0S (Bit 0)                                 */
#define BCCU_CHSTRCON_CH0S_Msk                (0x1UL)                   /*!< BCCU CHSTRCON: CH0S (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH1S_Pos                (1UL)                     /*!< BCCU CHSTRCON: CH1S (Bit 1)                                 */
#define BCCU_CHSTRCON_CH1S_Msk                (0x2UL)                   /*!< BCCU CHSTRCON: CH1S (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH2S_Pos                (2UL)                     /*!< BCCU CHSTRCON: CH2S (Bit 2)                                 */
#define BCCU_CHSTRCON_CH2S_Msk                (0x4UL)                   /*!< BCCU CHSTRCON: CH2S (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH3S_Pos                (3UL)                     /*!< BCCU CHSTRCON: CH3S (Bit 3)                                 */
#define BCCU_CHSTRCON_CH3S_Msk                (0x8UL)                   /*!< BCCU CHSTRCON: CH3S (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH4S_Pos                (4UL)                     /*!< BCCU CHSTRCON: CH4S (Bit 4)                                 */
#define BCCU_CHSTRCON_CH4S_Msk                (0x10UL)                  /*!< BCCU CHSTRCON: CH4S (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH5S_Pos                (5UL)                     /*!< BCCU CHSTRCON: CH5S (Bit 5)                                 */
#define BCCU_CHSTRCON_CH5S_Msk                (0x20UL)                  /*!< BCCU CHSTRCON: CH5S (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH6S_Pos                (6UL)                     /*!< BCCU CHSTRCON: CH6S (Bit 6)                                 */
#define BCCU_CHSTRCON_CH6S_Msk                (0x40UL)                  /*!< BCCU CHSTRCON: CH6S (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH7S_Pos                (7UL)                     /*!< BCCU CHSTRCON: CH7S (Bit 7)                                 */
#define BCCU_CHSTRCON_CH7S_Msk                (0x80UL)                  /*!< BCCU CHSTRCON: CH7S (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH8S_Pos                (8UL)                     /*!< BCCU CHSTRCON: CH8S (Bit 8)                                 */
#define BCCU_CHSTRCON_CH8S_Msk                (0x100UL)                 /*!< BCCU CHSTRCON: CH8S (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH0A_Pos                (16UL)                    /*!< BCCU CHSTRCON: CH0A (Bit 16)                                */
#define BCCU_CHSTRCON_CH0A_Msk                (0x10000UL)               /*!< BCCU CHSTRCON: CH0A (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH1A_Pos                (17UL)                    /*!< BCCU CHSTRCON: CH1A (Bit 17)                                */
#define BCCU_CHSTRCON_CH1A_Msk                (0x20000UL)               /*!< BCCU CHSTRCON: CH1A (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH2A_Pos                (18UL)                    /*!< BCCU CHSTRCON: CH2A (Bit 18)                                */
#define BCCU_CHSTRCON_CH2A_Msk                (0x40000UL)               /*!< BCCU CHSTRCON: CH2A (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH3A_Pos                (19UL)                    /*!< BCCU CHSTRCON: CH3A (Bit 19)                                */
#define BCCU_CHSTRCON_CH3A_Msk                (0x80000UL)               /*!< BCCU CHSTRCON: CH3A (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH4A_Pos                (20UL)                    /*!< BCCU CHSTRCON: CH4A (Bit 20)                                */
#define BCCU_CHSTRCON_CH4A_Msk                (0x100000UL)              /*!< BCCU CHSTRCON: CH4A (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH5A_Pos                (21UL)                    /*!< BCCU CHSTRCON: CH5A (Bit 21)                                */
#define BCCU_CHSTRCON_CH5A_Msk                (0x200000UL)              /*!< BCCU CHSTRCON: CH5A (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH6A_Pos                (22UL)                    /*!< BCCU CHSTRCON: CH6A (Bit 22)                                */
#define BCCU_CHSTRCON_CH6A_Msk                (0x400000UL)              /*!< BCCU CHSTRCON: CH6A (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH7A_Pos                (23UL)                    /*!< BCCU CHSTRCON: CH7A (Bit 23)                                */
#define BCCU_CHSTRCON_CH7A_Msk                (0x800000UL)              /*!< BCCU CHSTRCON: CH7A (Bitfield-Mask: 0x01)                   */
#define BCCU_CHSTRCON_CH8A_Pos                (24UL)                    /*!< BCCU CHSTRCON: CH8A (Bit 24)                                */
#define BCCU_CHSTRCON_CH8A_Msk                (0x1000000UL)             /*!< BCCU CHSTRCON: CH8A (Bitfield-Mask: 0x01)                   */

/* ---------------------------------  BCCU_LTCHOL  -------------------------------- */
#define BCCU_LTCHOL_LTOL0_Pos                 (0UL)                     /*!< BCCU LTCHOL: LTOL0 (Bit 0)                                  */
#define BCCU_LTCHOL_LTOL0_Msk                 (0x1UL)                   /*!< BCCU LTCHOL: LTOL0 (Bitfield-Mask: 0x01)                    */
#define BCCU_LTCHOL_LTOL1_Pos                 (1UL)                     /*!< BCCU LTCHOL: LTOL1 (Bit 1)                                  */
#define BCCU_LTCHOL_LTOL1_Msk                 (0x2UL)                   /*!< BCCU LTCHOL: LTOL1 (Bitfield-Mask: 0x01)                    */
#define BCCU_LTCHOL_LTOL2_Pos                 (2UL)                     /*!< BCCU LTCHOL: LTOL2 (Bit 2)                                  */
#define BCCU_LTCHOL_LTOL2_Msk                 (0x4UL)                   /*!< BCCU LTCHOL: LTOL2 (Bitfield-Mask: 0x01)                    */
#define BCCU_LTCHOL_LTOL3_Pos                 (3UL)                     /*!< BCCU LTCHOL: LTOL3 (Bit 3)                                  */
#define BCCU_LTCHOL_LTOL3_Msk                 (0x8UL)                   /*!< BCCU LTCHOL: LTOL3 (Bitfield-Mask: 0x01)                    */
#define BCCU_LTCHOL_LTOL4_Pos                 (4UL)                     /*!< BCCU LTCHOL: LTOL4 (Bit 4)                                  */
#define BCCU_LTCHOL_LTOL4_Msk                 (0x10UL)                  /*!< BCCU LTCHOL: LTOL4 (Bitfield-Mask: 0x01)                    */
#define BCCU_LTCHOL_LTOL5_Pos                 (5UL)                     /*!< BCCU LTCHOL: LTOL5 (Bit 5)                                  */
#define BCCU_LTCHOL_LTOL5_Msk                 (0x20UL)                  /*!< BCCU LTCHOL: LTOL5 (Bitfield-Mask: 0x01)                    */
#define BCCU_LTCHOL_LTOL6_Pos                 (6UL)                     /*!< BCCU LTCHOL: LTOL6 (Bit 6)                                  */
#define BCCU_LTCHOL_LTOL6_Msk                 (0x40UL)                  /*!< BCCU LTCHOL: LTOL6 (Bitfield-Mask: 0x01)                    */
#define BCCU_LTCHOL_LTOL7_Pos                 (7UL)                     /*!< BCCU LTCHOL: LTOL7 (Bit 7)                                  */
#define BCCU_LTCHOL_LTOL7_Msk                 (0x80UL)                  /*!< BCCU LTCHOL: LTOL7 (Bitfield-Mask: 0x01)                    */
#define BCCU_LTCHOL_LTOL8_Pos                 (8UL)                     /*!< BCCU LTCHOL: LTOL8 (Bit 8)                                  */
#define BCCU_LTCHOL_LTOL8_Msk                 (0x100UL)                 /*!< BCCU LTCHOL: LTOL8 (Bitfield-Mask: 0x01)                    */

/* ----------------------------------  BCCU_DEEN  --------------------------------- */
#define BCCU_DEEN_EDE0_Pos                    (0UL)                     /*!< BCCU DEEN: EDE0 (Bit 0)                                     */
#define BCCU_DEEN_EDE0_Msk                    (0x1UL)                   /*!< BCCU DEEN: EDE0 (Bitfield-Mask: 0x01)                       */
#define BCCU_DEEN_EDE1_Pos                    (1UL)                     /*!< BCCU DEEN: EDE1 (Bit 1)                                     */
#define BCCU_DEEN_EDE1_Msk                    (0x2UL)                   /*!< BCCU DEEN: EDE1 (Bitfield-Mask: 0x01)                       */
#define BCCU_DEEN_EDE2_Pos                    (2UL)                     /*!< BCCU DEEN: EDE2 (Bit 2)                                     */
#define BCCU_DEEN_EDE2_Msk                    (0x4UL)                   /*!< BCCU DEEN: EDE2 (Bitfield-Mask: 0x01)                       */

/* --------------------------------  BCCU_DESTRCON  ------------------------------- */
#define BCCU_DESTRCON_DE0S_Pos                (0UL)                     /*!< BCCU DESTRCON: DE0S (Bit 0)                                 */
#define BCCU_DESTRCON_DE0S_Msk                (0x1UL)                   /*!< BCCU DESTRCON: DE0S (Bitfield-Mask: 0x01)                   */
#define BCCU_DESTRCON_DE1S_Pos                (1UL)                     /*!< BCCU DESTRCON: DE1S (Bit 1)                                 */
#define BCCU_DESTRCON_DE1S_Msk                (0x2UL)                   /*!< BCCU DESTRCON: DE1S (Bitfield-Mask: 0x01)                   */
#define BCCU_DESTRCON_DE2S_Pos                (2UL)                     /*!< BCCU DESTRCON: DE2S (Bit 2)                                 */
#define BCCU_DESTRCON_DE2S_Msk                (0x4UL)                   /*!< BCCU DESTRCON: DE2S (Bitfield-Mask: 0x01)                   */
#define BCCU_DESTRCON_DE0A_Pos                (16UL)                    /*!< BCCU DESTRCON: DE0A (Bit 16)                                */
#define BCCU_DESTRCON_DE0A_Msk                (0x10000UL)               /*!< BCCU DESTRCON: DE0A (Bitfield-Mask: 0x01)                   */
#define BCCU_DESTRCON_DE1A_Pos                (17UL)                    /*!< BCCU DESTRCON: DE1A (Bit 17)                                */
#define BCCU_DESTRCON_DE1A_Msk                (0x20000UL)               /*!< BCCU DESTRCON: DE1A (Bitfield-Mask: 0x01)                   */
#define BCCU_DESTRCON_DE2A_Pos                (18UL)                    /*!< BCCU DESTRCON: DE2A (Bit 18)                                */
#define BCCU_DESTRCON_DE2A_Msk                (0x40000UL)               /*!< BCCU DESTRCON: DE2A (Bitfield-Mask: 0x01)                   */

/* --------------------------------  BCCU_GLOBDIM  -------------------------------- */
#define BCCU_GLOBDIM_GLOBDIM_Pos              (0UL)                     /*!< BCCU GLOBDIM: GLOBDIM (Bit 0)                               */
#define BCCU_GLOBDIM_GLOBDIM_Msk              (0xfffUL)                 /*!< BCCU GLOBDIM: GLOBDIM (Bitfield-Mask: 0xfff)                */

/* ---------------------------------  BCCU_EVIER  --------------------------------- */
#define BCCU_EVIER_T0IEN_Pos                  (0UL)                     /*!< BCCU EVIER: T0IEN (Bit 0)                                   */
#define BCCU_EVIER_T0IEN_Msk                  (0x1UL)                   /*!< BCCU EVIER: T0IEN (Bitfield-Mask: 0x01)                     */
#define BCCU_EVIER_T1IEN_Pos                  (1UL)                     /*!< BCCU EVIER: T1IEN (Bit 1)                                   */
#define BCCU_EVIER_T1IEN_Msk                  (0x2UL)                   /*!< BCCU EVIER: T1IEN (Bitfield-Mask: 0x01)                     */
#define BCCU_EVIER_FIEN_Pos                   (2UL)                     /*!< BCCU EVIER: FIEN (Bit 2)                                    */
#define BCCU_EVIER_FIEN_Msk                   (0x4UL)                   /*!< BCCU EVIER: FIEN (Bitfield-Mask: 0x01)                      */
#define BCCU_EVIER_EIEN_Pos                   (3UL)                     /*!< BCCU EVIER: EIEN (Bit 3)                                    */
#define BCCU_EVIER_EIEN_Msk                   (0x8UL)                   /*!< BCCU EVIER: EIEN (Bitfield-Mask: 0x01)                      */
#define BCCU_EVIER_TPIEN_Pos                  (4UL)                     /*!< BCCU EVIER: TPIEN (Bit 4)                                   */
#define BCCU_EVIER_TPIEN_Msk                  (0x10UL)                  /*!< BCCU EVIER: TPIEN (Bitfield-Mask: 0x01)                     */

/* ----------------------------------  BCCU_EVFR  --------------------------------- */
#define BCCU_EVFR_T0F_Pos                     (0UL)                     /*!< BCCU EVFR: T0F (Bit 0)                                      */
#define BCCU_EVFR_T0F_Msk                     (0x1UL)                   /*!< BCCU EVFR: T0F (Bitfield-Mask: 0x01)                        */
#define BCCU_EVFR_T1F_Pos                     (1UL)                     /*!< BCCU EVFR: T1F (Bit 1)                                      */
#define BCCU_EVFR_T1F_Msk                     (0x2UL)                   /*!< BCCU EVFR: T1F (Bitfield-Mask: 0x01)                        */
#define BCCU_EVFR_FF_Pos                      (2UL)                     /*!< BCCU EVFR: FF (Bit 2)                                       */
#define BCCU_EVFR_FF_Msk                      (0x4UL)                   /*!< BCCU EVFR: FF (Bitfield-Mask: 0x01)                         */
#define BCCU_EVFR_EF_Pos                      (3UL)                     /*!< BCCU EVFR: EF (Bit 3)                                       */
#define BCCU_EVFR_EF_Msk                      (0x8UL)                   /*!< BCCU EVFR: EF (Bitfield-Mask: 0x01)                         */
#define BCCU_EVFR_TPF_Pos                     (4UL)                     /*!< BCCU EVFR: TPF (Bit 4)                                      */
#define BCCU_EVFR_TPF_Msk                     (0x10UL)                  /*!< BCCU EVFR: TPF (Bitfield-Mask: 0x01)                        */
#define BCCU_EVFR_TPSF_Pos                    (6UL)                     /*!< BCCU EVFR: TPSF (Bit 6)                                     */
#define BCCU_EVFR_TPSF_Msk                    (0x40UL)                  /*!< BCCU EVFR: TPSF (Bitfield-Mask: 0x01)                       */
#define BCCU_EVFR_TPINL_Pos                   (7UL)                     /*!< BCCU EVFR: TPINL (Bit 7)                                    */
#define BCCU_EVFR_TPINL_Msk                   (0x80UL)                  /*!< BCCU EVFR: TPINL (Bitfield-Mask: 0x01)                      */

/* ---------------------------------  BCCU_EVFSR  --------------------------------- */
#define BCCU_EVFSR_T0FS_Pos                   (0UL)                     /*!< BCCU EVFSR: T0FS (Bit 0)                                    */
#define BCCU_EVFSR_T0FS_Msk                   (0x1UL)                   /*!< BCCU EVFSR: T0FS (Bitfield-Mask: 0x01)                      */
#define BCCU_EVFSR_T1FS_Pos                   (1UL)                     /*!< BCCU EVFSR: T1FS (Bit 1)                                    */
#define BCCU_EVFSR_T1FS_Msk                   (0x2UL)                   /*!< BCCU EVFSR: T1FS (Bitfield-Mask: 0x01)                      */
#define BCCU_EVFSR_FFS_Pos                    (2UL)                     /*!< BCCU EVFSR: FFS (Bit 2)                                     */
#define BCCU_EVFSR_FFS_Msk                    (0x4UL)                   /*!< BCCU EVFSR: FFS (Bitfield-Mask: 0x01)                       */
#define BCCU_EVFSR_EFS_Pos                    (3UL)                     /*!< BCCU EVFSR: EFS (Bit 3)                                     */
#define BCCU_EVFSR_EFS_Msk                    (0x8UL)                   /*!< BCCU EVFSR: EFS (Bitfield-Mask: 0x01)                       */
#define BCCU_EVFSR_TPFS_Pos                   (4UL)                     /*!< BCCU EVFSR: TPFS (Bit 4)                                    */
#define BCCU_EVFSR_TPFS_Msk                   (0x10UL)                  /*!< BCCU EVFSR: TPFS (Bitfield-Mask: 0x01)                      */
#define BCCU_EVFSR_TPS_Pos                    (6UL)                     /*!< BCCU EVFSR: TPS (Bit 6)                                     */
#define BCCU_EVFSR_TPS_Msk                    (0x40UL)                  /*!< BCCU EVFSR: TPS (Bitfield-Mask: 0x01)                       */

/* ---------------------------------  BCCU_EVFCR  --------------------------------- */
#define BCCU_EVFCR_T0FC_Pos                   (0UL)                     /*!< BCCU EVFCR: T0FC (Bit 0)                                    */
#define BCCU_EVFCR_T0FC_Msk                   (0x1UL)                   /*!< BCCU EVFCR: T0FC (Bitfield-Mask: 0x01)                      */
#define BCCU_EVFCR_T1FC_Pos                   (1UL)                     /*!< BCCU EVFCR: T1FC (Bit 1)                                    */
#define BCCU_EVFCR_T1FC_Msk                   (0x2UL)                   /*!< BCCU EVFCR: T1FC (Bitfield-Mask: 0x01)                      */
#define BCCU_EVFCR_FFC_Pos                    (2UL)                     /*!< BCCU EVFCR: FFC (Bit 2)                                     */
#define BCCU_EVFCR_FFC_Msk                    (0x4UL)                   /*!< BCCU EVFCR: FFC (Bitfield-Mask: 0x01)                       */
#define BCCU_EVFCR_EFC_Pos                    (3UL)                     /*!< BCCU EVFCR: EFC (Bit 3)                                     */
#define BCCU_EVFCR_EFC_Msk                    (0x8UL)                   /*!< BCCU EVFCR: EFC (Bitfield-Mask: 0x01)                       */
#define BCCU_EVFCR_TPFC_Pos                   (4UL)                     /*!< BCCU EVFCR: TPFC (Bit 4)                                    */
#define BCCU_EVFCR_TPFC_Msk                   (0x10UL)                  /*!< BCCU EVFCR: TPFC (Bitfield-Mask: 0x01)                      */
#define BCCU_EVFCR_TPC_Pos                    (6UL)                     /*!< BCCU EVFCR: TPC (Bit 6)                                     */
#define BCCU_EVFCR_TPC_Msk                    (0x40UL)                  /*!< BCCU EVFCR: TPC (Bitfield-Mask: 0x01)                       */


/* ================================================================================ */
/* ================         Group 'BCCU_CH' Position & Mask        ================ */
/* ================================================================================ */


/* --------------------------------  BCCU_CH_INTS  -------------------------------- */
#define BCCU_CH_INTS_TCHINT_Pos               (0UL)                     /*!< BCCU_CH INTS: TCHINT (Bit 0)                                */
#define BCCU_CH_INTS_TCHINT_Msk               (0xfffUL)                 /*!< BCCU_CH INTS: TCHINT (Bitfield-Mask: 0xfff)                 */

/* ---------------------------------  BCCU_CH_INT  -------------------------------- */
#define BCCU_CH_INT_CHINT_Pos                 (0UL)                     /*!< BCCU_CH INT: CHINT (Bit 0)                                  */
#define BCCU_CH_INT_CHINT_Msk                 (0xfffUL)                 /*!< BCCU_CH INT: CHINT (Bitfield-Mask: 0xfff)                   */

/* ------------------------------  BCCU_CH_CHCONFIG  ------------------------------ */
#define BCCU_CH_CHCONFIG_PKTH_Pos             (0UL)                     /*!< BCCU_CH CHCONFIG: PKTH (Bit 0)                              */
#define BCCU_CH_CHCONFIG_PKTH_Msk             (0x7UL)                   /*!< BCCU_CH CHCONFIG: PKTH (Bitfield-Mask: 0x07)                */
#define BCCU_CH_CHCONFIG_PEN_Pos              (3UL)                     /*!< BCCU_CH CHCONFIG: PEN (Bit 3)                               */
#define BCCU_CH_CHCONFIG_PEN_Msk              (0x8UL)                   /*!< BCCU_CH CHCONFIG: PEN (Bitfield-Mask: 0x01)                 */
#define BCCU_CH_CHCONFIG_DSEL_Pos             (4UL)                     /*!< BCCU_CH CHCONFIG: DSEL (Bit 4)                              */
#define BCCU_CH_CHCONFIG_DSEL_Msk             (0x70UL)                  /*!< BCCU_CH CHCONFIG: DSEL (Bitfield-Mask: 0x07)                */
#define BCCU_CH_CHCONFIG_DBP_Pos              (7UL)                     /*!< BCCU_CH CHCONFIG: DBP (Bit 7)                               */
#define BCCU_CH_CHCONFIG_DBP_Msk              (0x80UL)                  /*!< BCCU_CH CHCONFIG: DBP (Bitfield-Mask: 0x01)                 */
#define BCCU_CH_CHCONFIG_GEN_Pos              (8UL)                     /*!< BCCU_CH CHCONFIG: GEN (Bit 8)                               */
#define BCCU_CH_CHCONFIG_GEN_Msk              (0x100UL)                 /*!< BCCU_CH CHCONFIG: GEN (Bitfield-Mask: 0x01)                 */
#define BCCU_CH_CHCONFIG_WEN_Pos              (9UL)                     /*!< BCCU_CH CHCONFIG: WEN (Bit 9)                               */
#define BCCU_CH_CHCONFIG_WEN_Msk              (0x200UL)                 /*!< BCCU_CH CHCONFIG: WEN (Bitfield-Mask: 0x01)                 */
#define BCCU_CH_CHCONFIG_TRED_Pos             (10UL)                    /*!< BCCU_CH CHCONFIG: TRED (Bit 10)                             */
#define BCCU_CH_CHCONFIG_TRED_Msk             (0x400UL)                 /*!< BCCU_CH CHCONFIG: TRED (Bitfield-Mask: 0x01)                */
#define BCCU_CH_CHCONFIG_ENFT_Pos             (11UL)                    /*!< BCCU_CH CHCONFIG: ENFT (Bit 11)                             */
#define BCCU_CH_CHCONFIG_ENFT_Msk             (0x800UL)                 /*!< BCCU_CH CHCONFIG: ENFT (Bitfield-Mask: 0x01)                */
#define BCCU_CH_CHCONFIG_LINPRES_Pos          (16UL)                    /*!< BCCU_CH CHCONFIG: LINPRES (Bit 16)                          */
#define BCCU_CH_CHCONFIG_LINPRES_Msk          (0x3ff0000UL)             /*!< BCCU_CH CHCONFIG: LINPRES (Bitfield-Mask: 0x3ff)            */

/* --------------------------------  BCCU_CH_PKCMP  ------------------------------- */
#define BCCU_CH_PKCMP_OFFCMP_Pos              (0UL)                     /*!< BCCU_CH PKCMP: OFFCMP (Bit 0)                               */
#define BCCU_CH_PKCMP_OFFCMP_Msk              (0xffUL)                  /*!< BCCU_CH PKCMP: OFFCMP (Bitfield-Mask: 0xff)                 */
#define BCCU_CH_PKCMP_ONCMP_Pos               (16UL)                    /*!< BCCU_CH PKCMP: ONCMP (Bit 16)                               */
#define BCCU_CH_PKCMP_ONCMP_Msk               (0xff0000UL)              /*!< BCCU_CH PKCMP: ONCMP (Bitfield-Mask: 0xff)                  */

